---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FormulaBasedParameterCannotBeChanged
source: html/343ed96f-f455-0632-d126-1efd15a369b7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FormulaBasedParameterCannotBeChanged Property

Parameter '[Caption]' cannot be changed because it is defined by formula '[Formula]'

## Syntax (C#)
```csharp
public static FailureDefinitionId FormulaBasedParameterCannotBeChanged { get; }
```